In [2]:
# Imports 
import random 
import names
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [13]:
df = pd.DataFrame()

In [14]:
sample_id = []

for i in range(0,500):
    sample = ("A001_0" + str(i))
    sample_id.append(sample)  
    
df["sample_id"] = sample_id

In [15]:
df

     sample_id
0      A001_00
1      A001_01
2      A001_02
3      A001_03
4      A001_04
..         ...
495  A001_0495
496  A001_0496
497  A001_0497
498  A001_0498
499  A001_0499

[500 rows x 1 columns]

In [24]:


random.seed(1)


Gender = random.choices(genders, k = 500)
df['gender'] = Gender
df

     sample_id  gender
0      A001_00    Male
1      A001_01  Female
2      A001_02  Female
3      A001_03    Male
4      A001_04    Male
..         ...     ...
495  A001_0495  Female
496  A001_0496    Male
497  A001_0497  Female
498  A001_0498  Female
499  A001_0499    Male

[500 rows x 2 columns]

In [31]:
last_name = []

for i in range(500):
        rand_name = names.get_last_name()
        last_name.append(rand_name)

In [33]:
df['last_name'] = last_name
df

     sample_id  gender   last_name
0      A001_00    Male   Railsback
1      A001_01  Female       White
2      A001_02  Female        Neal
3      A001_03    Male  Albaladejo
4      A001_04    Male    Maultsby
..         ...     ...         ...
495  A001_0495  Female      Powell
496  A001_0496    Male     Hoggins
497  A001_0497  Female       Cantu
498  A001_0498  Female     Bridges
499  A001_0499    Male    Kreisler

[500 rows x 3 columns]

In [39]:
first_name = []

for i in df['gender']:
    if i == "Male":
        rand_name = names.get_first_name(gender='male')
        
    else:
        rand_name = names.get_first_name(gender='female')
        
    first_name.append(rand_name)

In [37]:
df['first_name'] = first_name

In [40]:
age_list = []

for i in range(0, 500):
    n = random.randint(20, 79)
    age_list.append(n)
    
df['age'] = age_list

In [57]:
weight = np.random.normal(85.93 if gender == 0 else 71.46, 
                          14.37 if gender == 0 else 14.09)
height = np.random.normal(176 if gender == 0 else 162,
                          0.68 if gender == 0 else 0.63)

# print(height)
#list.add(i, height=height)

bmi = weight / ((height/100)**2)
# print(bmi)

bmi_list = []
height_list = []

for i in range(500):
    weight = np.random.normal(85.93 if gender == 0 else 71.46, 
                          14.37 if gender == 0 else 14.09)
    height = np.random.normal(176 if gender == 0 else 162,
                          0.68 if gender == 0 else 0.63)
    bmi = weight / ((height/100)**2)
    bmi_list.append(np.round(bmi, 2))
    height_list.append(height)

In [58]:
df['height'] = height_list
df['BMI'] = bmi_list